Repository: Korakk/Python_TorF-i18n-
Catalog: *.po
Languages: ca, es

source: How many legs does a crab have?
ca: Quantes potes té un cranc?
es: Cuantas patas tiene un cangrejo?

source: Is John/Jane Doe real?
ca: És John/Jane Doe real?
es: És John/Jane Doe real?

source: Tabs or spaces, how do you indent your code?
ca: Tabs (tabuladors) o espais, amb que indentes el teu codi?
es: Tabs o espacios, como indentas tu código?

source: How many pokémons appear on the classic 1st gen pokedex?
ca: Quants pokemons apareixen a la pokedex clàssica de 1a gen?
es: Cuántos pokémons aparecen en la pokédex clásica de 1a gen?

source: Is chess a recognized sport?
ca: Els escacs són un esport?
es: El ajedrez es un deporte reconozido?

source: spaces
ca: espais
es: espacios

source: yes
ca: si
es: si

source: Question number
ca: Pregunta número
es: Pregunta número

source: Your answer is correct!
ca: La teva resposta és correcta!
es: Tu respuesta es correcta!

source: You failed. Restart the game and try again! See you later.
ca: Has fallat. No et desanimis i torna a començar! Fins aviat.
es: Has fallado. No te rindas, reinicia el juego y intentalo otra vez! Nos vemos.

source: Hi, what's your username?
ca: Hola, quin es el teu usuari?
es: Hola, cuál es tu usuario?

source: Hello
ca: Hola
es: Hola

source: Do you want to start playing the game? (y/n)
ca: Vols començar a jugar al joc? (y(si)/n(no))
es: Vamos a jugar a un juego? (y(si)/n(no))

source: Please input y(yes) or n(no)! Come on is not that hard [y/n]
ca: Siusplau introdueix y(si) o n(no)! No es tant dificil eh! [y(si)/n(no)]
es: Haz el favor de escribir y(si) o n(no)! No es tant difícil máquina [y(si)/n(no)]

source: Answer correctly 5/5 questions to WIN!
ca: Contesta correctament 5/5 preguntes i VICTÒRIA!
es: Responde correctamente 5/5 preguntas i VICTORIA!

source: Answer questions in one word, let's begin
ca: Contesta les preguntes en una sola paraula, que comenci el joc!
es: Responde las preguntas en una palabra, empecemos

source: You WIN!
ca: VICTÒRIA
es: VICTORIA
